###############################################################
#  Generated by:      Cadence Innovus 21.17-s075_1
#  OS:                Linux x86_64(Host ID vcl-vm0-175)
#  Generated on:      Wed Apr 22 03:07:24 2026
#  Design:            ipdc
#  Command:           saveDesign RoutingOpt
###############################################################
current_design ipdc
create_clock [get_ports {i_clk}]  -name i_clk -period 2000.000000 -waveform {0.000000 1000.000000}
set_propagated_clock  [get_clocks {i_clk}]
set_propagated_clock  [get_ports {i_clk}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[20]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[13]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[9]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_valid}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[11]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[7]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[5]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_op_valid}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_op_mode[2]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[3]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_op_mode[0]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[1]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[18]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[23]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[16]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[21]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[14]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[12]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[8]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[10]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[6]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_op_mode[3]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[4]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_op_mode[1]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[2]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_rst_n}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[0]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[19]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[17]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[22]}]
set_input_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {i_in_data[15]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[18]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[23]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[16]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[21]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[14]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[12]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[10]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[9]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[7]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_in_ready}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[5]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[3]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_op_ready}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[1]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[19]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[17]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[22]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[15]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_valid}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[20]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[13]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[11]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[8]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[6]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[4]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[2]}]
set_output_delay -add_delay 300 -clock [get_clocks {i_clk}] [get_ports {o_out_data[0]}]
set_false_path  -from [get_ports {i_rst_n}] 
