###################################################################

# Created by write_sdc on Sat Apr  4 18:12:02 2026

###################################################################
set sdc_version 2.1

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current mA
set_max_area 0
create_clock [get_ports i_clk]  -period 2000  -waveform {0 1000}
set_false_path   -from [get_ports i_rst_n]
set_input_delay -clock i_clk  300  [get_ports i_clk]
set_input_delay -clock i_clk  300  [get_ports i_rst_n]
set_input_delay -clock i_clk  300  [get_ports i_op_valid]
set_input_delay -clock i_clk  300  [get_ports {i_op_mode[3]}]
set_input_delay -clock i_clk  300  [get_ports {i_op_mode[2]}]
set_input_delay -clock i_clk  300  [get_ports {i_op_mode[1]}]
set_input_delay -clock i_clk  300  [get_ports {i_op_mode[0]}]
set_input_delay -clock i_clk  300  [get_ports i_in_valid]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[23]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[22]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[21]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[20]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[19]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[18]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[17]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[16]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[15]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[14]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[13]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[12]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[11]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[10]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[9]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[8]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[7]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[6]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[5]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[4]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[3]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[2]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[1]}]
set_input_delay -clock i_clk  300  [get_ports {i_in_data[0]}]
set_output_delay -clock i_clk  300  [get_ports o_op_ready]
set_output_delay -clock i_clk  300  [get_ports o_in_ready]
set_output_delay -clock i_clk  300  [get_ports o_out_valid]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[23]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[22]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[21]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[20]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[19]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[18]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[17]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[16]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[15]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[14]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[13]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[12]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[11]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[10]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[9]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[8]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[7]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[6]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[5]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[4]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[3]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[2]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[1]}]
set_output_delay -clock i_clk  300  [get_ports {o_out_data[0]}]
